src/Documents/Договор/Договор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Договор</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДелам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.СтруктураФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квитанции</name>
    <attributes>
      <name>НомерКвитанции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>125</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУслуги</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/НомераКвитанций/НомераКвитанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКвитанций</name>
  <comment>для поиска дел по № квитанции</comment>
  <resources>
    <name>Договор</name>
    <type>
      <types>DocumentRef.Договор</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерКвитанции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Договор/ObjectModule.bsl
////////////////////////////////////////////////////////////////////
//
//
//
//



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	if ОбменДанными.Загрузка then
		return;
	endif;
	
	OnlineCashboxКлиентСервер.ПодсчитатьИтоговыеСуммы(Сумма, СуммаНДС, Квитанции);	
	
	КвитанцияСтрокой = "";
	for each row in Квитанции do
		КвитанцияСтрокой = КвитанцияСтрокой +?( StrLen(КвитанцияСтрокой)>0,"; ","") + row.Услуга;
	endDo;
	
	КонтрагентСтрокой = Контрагент.Наименование;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	if ОбменДанными.Загрузка then
		return;
	endif;
	
	if DeletionMark then
		query = new query;
		query.Text = 
		"ВЫБРАТЬ
		|	t.НомерКвитанции КАК НомерКвитанции,
		|	t.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.НомераКвитанций КАК t
		|ГДЕ
		|	t.Договор = &Ref
		|
		|ДЛЯ ИЗМЕНЕНИЯ";
		
		query.SetParameter("Ref", Ref);
		tblКвитанции = query.Execute().Unload();
		for each row in tblКвитанции do
			rec = РегистрыСведений.НомераКвитанций.СоздатьМенеджерЗаписи();
			rec.НомерКвитанции = row.НомерКвитанции;
			rec.Договор        = Ref;
			rec.Delete();
		endDo;
		
	else	
		//продублируем в регистр № квитанций
		for each row in Квитанции do
			if row.НомерКвитанции<>0 then
				rec = РегистрыСведений.НомераКвитанций.СоздатьМенеджерЗаписи();
				rec.НомерКвитанции = row.НомерКвитанции;
				rec.Договор        = Ref;
				rec.Write(true);
			endif;
		endDo;	
	endif;
	
КонецПроцедуры
